# LevelOfDetail Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOrShellTessellationControls..::..LevelOfDetail Property
SolidOrShellTessellationControls Class See Also
---
An number between 0 and 1 (inclusive) specifying the level of detail for the triangulation of a solid or shell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double LevelOfDetail { get; set; }
```

Visual Basic
---
```text
Public Property LevelOfDetail As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double LevelOfDetail {
	double get ();
	void set (double value);
}
```

# Remarks
Smaller values yield coarser triangulations (fewer triangles), while larger values yield finer triangulations (more triangles).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for levelOfDetail must lie between 0 and 1 (inclusive). |

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace